Revit 2027 API
RebarConstraint.GetConstraintType Method
 Returns the RebarConstraintType of a RebarConstraint.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarConstraintType GetConstraintType()
Public Function GetConstraintType As RebarConstraintType
public:
RebarConstraintType GetConstraintType()
member GetConstraintType : unit -> RebarConstraintType
Return Value
RebarConstraintType
 The RebarConstraintType of the specified RebarConstraint.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace